In [2]:
import pandas as pd

In [3]:
data_ls = [10,20,'John',15.02,'มะละกอ']

In [4]:
data_tp = (10,20,'John',15.02,'มะละกอ')

In [5]:
df_1 = pd.DataFrame(data_ls)

In [6]:
df_1

        0
0      10
1      20
2    John
3   15.02
4  มะละกอ

In [7]:
df_2 = pd.DataFrame(data_tp)

In [8]:
df_2

        0
0      10
1      20
2    John
3   15.02
4  มะละกอ

In [10]:
data = [15,20,25,36]
cols = ['Age']
df_3 = pd.DataFrame(data,columns=cols)
df_3s

   Age
0   15
1   20
2   25
3   36